docs/reference/walkthrough.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-26 Tue 22:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Walkthrough: sqrt at a sub-expression</title>
<meta name="author" content="David Yeung" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Walkthrough: sqrt at a sub-expression</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb19f120">1. Starting state</a></li>
<li><a href="#org87508cf">2. The declaration</a></li>
<li><a href="#org18eda19">3. Macro expansion</a></li>
<li><a href="#org0176080">4. Phase 1: resolve</a></li>
<li><a href="#org6d94e92">5. Phase 2: body</a>
<ul>
<li><a href="#org1e81fa4">5.1. Where the fix lives</a></li>
</ul>
</li>
<li><a href="#orgaca0836">6. Phase 3: commit</a></li>
<li><a href="#orgf01abe2">7. The encasing dance, summarized</a></li>
<li><a href="#org789537a">8. Variations at a glance</a></li>
</ul>
</div>
</div>
<p>
A single <code>maf-defcmd</code> command traced end-to-end. The example exercises the
trickiest part of the system (atom encasing), so seeing it concretely should
re-anchor the mental model.
</p>

<p>
For the higher-level overview, see <a href="concepts.html">concepts.org</a>.
</p>
<div id="outline-container-orgb19f120" class="outline-2">
<h2 id="orgb19f120"><span class="section-number-2">1.</span> Starting state</h2>
<div class="outline-text-2" id="text-1">
<p>
Stack:
</p>
<pre class="example" id="orgfedea03">
1: a + 16
</pre>

<p>
Point is on the <code>16</code> inside the entry's formula text (not at EOL, not in the
line-prefix zone). No active calc selection.
</p>
</div>
</div>
<div id="outline-container-org87508cf" class="outline-2">
<h2 id="org87508cf"><span class="section-number-2">2.</span> The declaration</h2>
<div class="outline-text-2" id="text-2">
<p>
The user writes:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(maf-defcmd maf-sqrt (expr arg commit)
  "Square-root command."
  :arity unary
  :prefix "sqrt"
  (commit (calcFunc-sqrt expr)))
</pre>
</div>

<p>
Three bindings the body sees:
</p>
<ul class="org-ul">
<li><code>expr</code> — the value the command operates on (depends on target)</li>
<li><code>arg</code> — second operand for binary commands (nil here, since unary)</li>
<li><code>commit</code> — a function the body calls with its result</li>
</ul>

<p>
Two options declared:
</p>
<ul class="org-ul">
<li><code>:arity</code> — <code>unary</code> or <code>binary</code>; required, validated at macroexpand time</li>
<li><code>:prefix</code> — calc trail label</li>
</ul>
</div>
</div>
<div id="outline-container-org18eda19" class="outline-2">
<h2 id="org18eda19"><span class="section-number-2">3.</span> Macro expansion</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>maf-defcmd</code> expands to:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun maf-sqrt ()
  "Square-root command."
  (interactive)
  (let* ((context-1234 (maf--resolve-context '((:prefix . "sqrt")
                                               (:arity . unary))))
         (expr (alist-get :expr context-1234))
         (arg  (alist-get :arg  context-1234)))
    (cl-flet ((commit (val) (maf--commit val context-1234)))
      (commit (calcFunc-sqrt expr)))))
</pre>
</div>

<p>
The user's body is unchanged. The scaffolding handles context resolution,
binding extraction, and the <code>commit</code> closure (which captures the context so
the body can call <code>commit</code> without passing it explicitly).
</p>
</div>
</div>
<div id="outline-container-org0176080" class="outline-2">
<h2 id="org0176080"><span class="section-number-2">4.</span> Phase 1: resolve</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>maf--resolve-context</code> is called with opts <code>((:prefix . "sqrt") (:arity . unary))</code>.
</p>

<p>
The cascade in <code>maf--resolve-context</code> checks predicates in priority order:
</p>

<ol class="org-ol">
<li><code>(maf--sel-any-p)</code> — is there an active calc selection anywhere?
No (user didn't <code>calc-select-here</code>). Skip.</li>
<li><code>(maf--at-home-p)</code> — is point past the last stack entry?
No, point is in the formula text. Skip.</li>
<li><code>(maf--at-subexpr-p)</code> — is point on a sub-expression within an entry?
Yes. Match — call <code>maf--resolve-target-subexpr</code>.</li>
</ol>

<p>
Inside <code>maf--resolve-target-subexpr</code>:
</p>

<ol class="org-ol">
<li><code>m = (calc-locate-cursor-element (point))</code> = 1 (point is on the top entry).</li>
<li>The <code>m=1 + binary</code> guard doesn't fire (we're unary).</li>
<li><p>
<code>(calc-prepare-selection 1)</code> — the load-bearing call. It <b>mutates</b> the stack
entry, encasing every naked atom as a <code>(cplx N 0)</code> cons cell so the
selection cache can track sub-expressions by <code>eq</code>.
</p>

<p>
After this call, the stack contains:
</p>
<pre class="example" id="org06d5eb4">
1: (+ (var a var-a) (cplx 16 0))
</pre>

<p>
The original integer <code>16</code> is gone — replaced by a fresh cons <code>(cplx 16 0)</code>.
</p></li>

<li><code>(calc-find-selected-part)</code> — walks the prepared composition tree to find
the sub-formula under cursor. Returns the <code>(cplx 16 0)</code> cons (the exact
same cons now in the entry's formula).</li>
</ol>

<p>
The returned context alist:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">((:target     . subexpr)
 (:expr       . 16)                  ;; clean — what the body sees
 (:expr-ref   . (cplx 16 0))         ;; encased — the eq-ref into the stack
 (:arg        . nil)                 ;; unary, no second operand
 (:m          . 1)                   ;; entry's stack position
 (:commit-m   . 1)                   ;; commit pushes at level 1
 (:commit-n   . 1)                   ;; pop 1 before pushing (replace in place)
 (:post-pop   . 0)                   ;; no extra pop (unary, no binary arg)
 (:reselect   . nil)                 ;; no user-set selection to preserve
 (:prefix     . "sqrt")              ;; merged from opts
 (:arity      . unary)
 (:keep       . nil))                ;; calc-keep-args-flag snapshot
</pre>
</div>

<p>
Note the two-value pair for the same sub-expression:
</p>
<ul class="org-ul">
<li><code>:expr</code> — clean 16; what the body operates on</li>
<li><code>:expr-ref</code> — the encased cons; the eq-ref commit needs for splicing</li>
</ul>
</div>
</div>
<div id="outline-container-org6d94e92" class="outline-2">
<h2 id="org6d94e92"><span class="section-number-2">5.</span> Phase 2: body</h2>
<div class="outline-text-2" id="text-5">
<p>
The body runs with <code>expr = 16</code>, <code>arg = nil</code>, <code>commit = (closure capturing context)</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(commit (calcFunc-sqrt expr))
</pre>
</div>

<p>
<code>calcFunc-sqrt</code> is a defalias for <code>math-sqrt</code> (calc-math.el:452). Called with
the clean integer <code>16</code>, <code>math-sqrt</code> takes the <b>integer branch</b> (line 380):
<code>(cl-isqrt 16)</code> = 4, <code>(* 4 4)</code> = 16 → returns the clean integer <code>4</code>.
</p>

<p>
So <code>val = 4</code>.
</p>
</div>
<div id="outline-container-org1e81fa4" class="outline-3">
<h3 id="org1e81fa4"><span class="section-number-3">5.1.</span> Where the fix lives</h3>
<div class="outline-text-3" id="text-5-1">
<p>
This is where the float-vs-integer fix is load-bearing. Resolve gives the
body the <b>clean</b> <code>:expr</code> (<code>16</code>, normalized) instead of the encased
<code>(cplx 16 0)</code>. Compare:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Path</th>
<th scope="col" class="org-left">Body sees</th>
<th scope="col" class="org-left">math-sqrt branch</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Final display</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">With fix (now)</td>
<td class="org-left"><code>16</code></td>
<td class="org-left">integer (l.380)</td>
<td class="org-left"><code>4</code></td>
<td class="org-left"><code>4</code></td>
</tr>

<tr>
<td class="org-left">Without fix (buggy)</td>
<td class="org-left"><code>(cplx 16 0)</code></td>
<td class="org-left">cplx (l.412)</td>
<td class="org-left"><code>(cplx (float 4 0) 0)</code></td>
<td class="org-left"><code>4.</code></td>
</tr>
</tbody>
</table>

<p>
The cplx branch of <code>math-sqrt</code> uses <code>(float 5 -1)</code> internally and routes
through <code>math-sqrt-float</code> — the float-ness is baked into the result the
moment that branch runs.
</p>

<p>
<b>There is no float-to-integer conversion in commit</b> — by the time commit
receives <code>val</code>, it's already a clean integer. The "fix" isn't a step that
converts; it's resolve handing the body a clean value so calc never
produces a float in the first place. <code>math-normalize</code> on <code>(cplx N 0)</code>
(calc-ext.el:2328) collapses cplx-with-zero-imag back to plain <code>N</code>, and
that happens in <code>maf--resolve-target-subexpr</code> <i>before</i> the body runs.
</p>

<p>
<code>commit</code> is invoked with <code>val = 4</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgaca0836" class="outline-2">
<h2 id="orgaca0836"><span class="section-number-2">6.</span> Phase 3: commit</h2>
<div class="outline-text-2" id="text-6">
<p>
<code>maf--commit</code> is called with <code>val = 4</code> and the context from Phase 1.
</p>

<p>
It destructures:
</p>
<pre class="example" id="org80c4900">
target      = subexpr
prefix      = "sqrt"
commit-m    = 1
commit-n    = 1
post-pop    = 0
m           = 1
</pre>

<p>
The <code>(or 'selection 'subexpr)</code> pcase branch fires:
</p>

<ol class="org-ol">
<li><code>expr-ref = (cplx 16 0)</code> — pulled from context.</li>
<li><code>full-formula = (calc-top 1 'full)</code> = <code>(+ (var a var-a) (cplx 16 0))</code>.</li>
<li><code>val-encased = (calc-encase-atoms val)</code> = <code>(cplx 4 0)</code> — a <b>new</b> cons we
hold a reference to. We pre-encase so we have a handle on the cell that
will end up in <code>new-formula</code> (needed for <code>:reselect</code> in the selection
branch; harmless here).</li>
<li><code>new-formula = (calc-replace-sub-formula full-formula expr-ref val-encased)</code>:
walks <code>full-formula</code> looking for a cons <code>eq</code> to <code>expr-ref</code>. Hits <code>(cplx 16 0)</code>
(literally the same cons, because <code>calc-prepare-selection</code> mutated the
entry to use that cell and we stashed a reference in <code>:expr-ref</code>).
Substitutes <code>val-encased</code>. Result: <code>(+ (var a var-a) (cplx 4 0))</code>.</li>
<li><code>sels = nil</code> — <code>:reselect</code> is <code>nil</code> for subexpr.</li>
<li><code>(maf--commit-push 1 "sqrt" new-formula 1 nil 0)</code> → calls
<code>(calc-pop-push-record-list 1 "sqrt" new-formula 1 nil)</code>: pop the old
entry at level 1, push the new one. No post-pop (<code>:post-pop</code> = 0).</li>
</ol>

<p>
Calc displays <code>(cplx N 0)</code> the same as <code>N</code> (cplx-with-zero-imag is just the
real part). So the final stack reads:
</p>

<pre class="example" id="org2d9bc8f">
1: a + 4
</pre>

<p>
The trail records the operation under "sqrt".
</p>
</div>
</div>
<div id="outline-container-orgf01abe2" class="outline-2">
<h2 id="orgf01abe2"><span class="section-number-2">7.</span> The encasing dance, summarized</h2>
<div class="outline-text-2" id="text-7">
<p>
Three places handle the encased cons. Each does a different job — don't
expect to see a <code>math-normalize</code> call in commit, because the cleanup
already happened in resolve.
</p>

<ol class="org-ol">
<li><b><b>resolve</b></b> (<a href="../../src/maf-resolve.el">maf-resolve.el</a>)
<ul class="org-ul">
<li>calls <code>calc-prepare-selection</code>, which encases atoms in the stack entry</li>
<li>captures both the clean form (<code>:expr</code>, via <code>math-normalize</code>) and the
encased ref (<code>:expr-ref</code>)</li>
<li><b>this is where the float-vs-integer fix lives</b> — by normalizing <code>:expr</code>,
the body never sees a cplx-wrapped value, so calc never routes its
computation through the complex/float branch</li>
</ul></li>
<li><b><b>body</b></b> (user code)
<ul class="org-ul">
<li>sees the clean <code>:expr</code>, so <code>calcFunc-*</code> functions take their
integer/rational branches instead of the cplx branch</li>
</ul></li>
<li><b><b>commit</b></b> (<a href="../../src/maf-commit.el">maf-commit.el</a>)
<ul class="org-ul">
<li>pre-encases <code>val</code> so we hold a reference to the cons that ends up
in <code>new-formula</code> (useful for <code>:reselect</code>)</li>
<li>uses <code>:expr-ref</code> (not <code>:expr</code>) for <code>calc-replace-sub-formula</code> because
only the encased cons is <code>eq</code> to the cell in the stack entry</li>
<li>commit does <i>not</i> normalize — its <code>val</code> is already clean, and the
encasing it does is for the <i>output</i> side (preserving selection state)</li>
</ul></li>
</ol>

<p>
This mirrors calc's own pattern: build an AST, normalize args at the
boundary, splice the encased result back in. See <code>calc-binary-op</code>
(calc.el:2227), <code>calc-enter-result</code> (calc.el:1896), and
<code>calc-replace-selections</code> (calc-sel.el:502) for the calc-internal
equivalent.
</p>
</div>
</div>
<div id="outline-container-org789537a" class="outline-2">
<h2 id="org789537a"><span class="section-number-2">8.</span> Variations at a glance</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><b>Selection target</b> (<code>:reselect t</code>) — same as above except <code>sels</code>
<code>val-encased</code>. The new entry's selection slot points at the cons in its
own formula → calc's selection display picks it up.</li>
<li><b>Home target</b> — no sub-formula splice; commit just pushes <code>val</code> at the
top. No encasing involvement.</li>
<li><b>Entry target</b> — replaces the whole entry at <code>:commit-m</code> with <code>val</code>. No
splice. Ergonomic shift: if point is at the top entry and arity is
binary, <code>:m</code> is shifted to 2 and the top becomes the binary arg.</li>
<li><b>Binary commands</b> — <code>:arg</code> is populated (<code>:post-pop</code> consumes it
after the push). For selection/subexpr/entry, an explicit guard
ensures the target isn't the top entry (no self-reference).</li>
<li><b>Keep-args mode</b> — <code>:commit-m</code> becomes 1 (push on top, leave originals),
<code>:commit-n</code> becomes 0 (no pop), <code>:post-pop</code> becomes 0 (no arg
consumption). Result lands above the original inputs instead of
replacing them.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Yeung</p>
<p class="date">Created: 2026-05-26 Tue 22:55</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
